REGULAR/Amesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       360;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       370;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          15;
        startFace       390;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          15;
        startFace       405;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       420;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          400;
        startFace       440;
    }
)

// ************************************************************************* //
