REGULAR/Amesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  location "system";
  object controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application rhoCentralFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 5.0;

deltaT 0.001;

writeControl adjustableRunTime;

writeInterval 0.1;

purgeWrite 0;

writeFormat ascii;

writePrecision 10;

writeCompression off;

timeFormat general;

timePrecision 10;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 0.2;

maxDeltaT 1;

// ************************************************************************* //

// functions 
// { 
//     #includeFunc  singleGraph 
// }

// ************************************************************************* //